# comment
print("hello")
print(3)
print ("Result : 5")
print("Result :", 5, 6, ".")
#функція print() для виводу інформаці

print(5, 7, sep="")
#Доповнювальне свойство sep="" для розділення (завжди повинно прописуатися в кінці)
print("Second line", end="\n")
#Дополнительне свойство end="" - без переходу на нову лінію
# \n деректива яка каже що потрібен перевод на нову лінію
print("Third line", 5, end="@\n")

print("second \" line")
print('second " line')
#\ спеціальний символ який розділяє, способи як написати це як озвичайний символ
print('s\nf\n')
#спосіб як написати все роздільно в новвій строці
print("second \t line")
#\t робить великий відступ між словами
print("second \\ line")
#\\ для тошо щоб вивести \

# Окрім виведу звичайної інформації print можна використовувати для математичних дій

print(5 + 5) #додавання
print(5 - 5) #віднімання
print(5 / 5) #ділення
print(5 * 5) #множення
print(5 % 5) #остача числа при діленні

#також можна проводити бліьш складніші математичні дії такі як :

print(5 ** 2) #взведення до квадрату
print(5 // 2) #ділення з цілим числом

#Математичні функції

print("result:", min(5, 2, -1)) #min() функція для знаходження найменшого числа
print("result:", max(5, 2, -1)) #max() функція для знаходження максимального числа
print("result:", abs(-6)) #abs() функція яка передає всі числа по модулю(передає позиитвне значення числа)
print("result:", pow(5, 2))     #pow() фукнція яка взводить число в степінь ( 5 ** 2)
print("result:", round(5 / 2))  #round() функця яка округляє числа з точкою ( 1,6 = 2 )

#Получення данних від користувача
input() #функція яка получає данні від користувача
print() #фукнція яка виводить данні

input("Put your age:")

